#include <stdio.h>

int main(void)
{
	printf("<AND 연산자의 진리표>\n");
	printf("0 && 0 : %d \n1 && 0 : %d \n0 && 1 : %d \n1 && 1 : %d\n", 0 & 0, 1 & 0, 0 & 1, 1 & 1);

	printf("OR 연산자의 진리표>\n");
	printf("0 || 0 : %d \n1 || 0 : %d \n0 || 1 : %d \n1 || 1 : %d\n", 0 | 0, 1 | 0, 0 | 1, 1 | 1);

	printf("XOR 연산자의 진리표\n");
	printf("0 ^ 0 : %d \n1 ^ 0 : %d \n0 ^ 1 : %d \n1 ^ 1 : %d\n", 0 ^ 0, 1 ^ 0, 0 ^ 1, 1 ^ 1);

	printf("NOT 연산자의 진리표\n");// 0을 1로, 1을 0으로 변환
	printf(" ~ 0 : %d \n ~ 1 : %d\n", ~0, ~1); // 0 = 0000 0000 -> 1111 1111(-1) | 1 = 0000 0001 -> 1111 1110(-2)

	printf("비트 이동 연산자\n");
	printf("4 << 1 : %d \n32 >> 3 : %d\n", 4 << 1, 32 >> 3);
}